export const KAZAKHSTAN_CITIES = [
  { label: "Астана", value: 0 },
  { label: "Алматы", value: 1 },
  { label: "Шымкент", value: 2 },
  { label: "Караганда", value: 3 },
  { label: "Актау", value: 4 },
  { label: "Актобе", value: 5 },
  { label: "Атырау", value: 6 },
  { label: "Тараз", value: 7 },
  { label: "Оскемен", value: 8 },
  { label: "Кокшетау", value: 9 },
];

export const ROOM_TYPES = [
  {
    label: "Одноместный номер",
    value: 1,
    namespaceOffset: 0,
    namespaceLength: 23,
  },
  {
    label: "Четырехместный номер",
    value: 2,
    namespaceOffset: 23,
    namespaceLength: 13,
  },
  {
    label: "Семейный номер",
    value: 3,
    namespaceOffset: 36,
    namespaceLength: 19,
  },
  {
    label: "Апартаменты",
    value: 4,
    namespaceOffset: 55,
    namespaceLength: 19,
  },
  {
    label: "Общий номер",
    value: 5,
    namespaceOffset: 74,
    namespaceLength: 32,
  },
  {
    label: "Двухместный номер с 1 кроватью",
    value: 6,
    namespaceOffset: 106,
    namespaceLength: 56,
  },
  {
    label: "Трехместный номер",
    value: 7,
    namespaceOffset: 162,
    namespaceLength: 24,
  },
  {
    label: "Коттедж",
    value: 8,
    namespaceOffset: 186,
    namespaceLength: 8,
  },
  {
    label: "Номер-студио",
    value: 9,
    namespaceOffset: 194,
    namespaceLength: 19,
  },
  {
    label: "Двухместный номер с 1 кроватью или 2 отдельными кроватями",
    value: 10,
    namespaceOffset: 213,
    namespaceLength: 39,
  },
  {
    label: "Двухместный номер с 2 отдельными кроватями",
    value: 11,
    namespaceOffset: 252,
    namespaceLength: 31,
  },
  {
    label: "Люкс номер",
    value: 12,
    namespaceOffset: 283,
    namespaceLength: 29,
  },
  {
    label: "Полу-люкс номер",
    value: 13,
    namespaceOffset: 312,
    namespaceLength: 7,
  },
  {
    label: "Юрта",
    value: 14,
    namespaceOffset: 319,
    namespaceLength: 5,
  },
  {
    label: "Бунгало",
    value: 15,
    namespaceOffset: 324,
    namespaceLength: 1,
  },
  {
    label: "Конференц-зал",
    value: 16,
    namespaceOffset: 325,
    namespaceLength: 1,
  },
  {
    label: "Пятиместный номер",
    value: 17,
    namespaceOffset: 326,
    namespaceLength: 3,
  },
  {
    label: "Шале",
    value: 18,
    namespaceOffset: 329,
    namespaceLength: 3,
  },
  {
    label: "Тапчан",
    value: 19,
    namespaceOffset: 332,
    namespaceLength: 1,
  },
  {
    label: "Общий 7-местный номер",
    value: 20,
    namespaceOffset: 333,
    namespaceLength: 1,
  },
  {
    label: "Общий 11-местный номер",
    value: 21,
    namespaceOffset: 334,
    namespaceLength: 1,
  },
  {
    label: "Общий 12-местный номер",
    value: 22,
    namespaceOffset: 335,
    namespaceLength: 1,
  },
  {
    label: "Общий 13-местный номер для женщин",
    value: 23,
    namespaceOffset: 336,
    namespaceLength: 1,
  },
];

export const ROOM_NAMES = [
  {
    label: "Одноместный номер Делюкс",
    value: 1,
  },
  {
    label: "Одноместный номер Делюкс с балконом",
    value: 2,
  },
  {
    label: "Одноместный номер Делюкс с видом на берег",
    value: 3,
  },
  {
    label: "Бюджетный одноместный номер",
    value: 4,
  },
  {
    label: "Просторный одноместный номер",
    value: 5,
  },
  {
    label: "Одноместный номер - Для физически ограниченных лиц",
    value: 6,
  },
  {
    label: "Стандартный одноместный номер с балконом",
    value: 7,
  },
  {
    label: "Стандартный одноместный номер с видом на сад",
    value: 8,
  },
  {
    label: "Стандартный одноместный номер с видом на озеро",
    value: 9,
  },
  {
    label: "Стандартный одноместный номер с видом на горы",
    value: 10,
  },
  {
    label: "Стандартный одноместный номер с видом на парк",
    value: 11,
  },
  {
    label: "Стандартный одноместный номер с видом на бассейн",
    value: 12,
  },
  {
    label: "Одноместный номер с собственной внешней ванной комнатой",
    value: 13,
  },
  {
    label: "Одноместный номер с общей ванной комнатой",
    value: 14,
  },
  {
    label: "Одноместный номер с общим туалетом",
    value: 15,
  },
  {
    label: "Стандартный одноместный номер с террасой",
    value: 16,
  },
  {
    label: "Стандартный одноместный номер",
    value: 17,
  },
  {
    label: "Улучшенный одноместный номер",
    value: 18,
  },
  {
    label: "Улучшенный одноместный номер с видом на озеро",
    value: 19,
  },
  {
    label: "Небольшой одноместный номер",
    value: 20,
  },
  {
    label: "Одноместный номер без окон",
    value: 21,
  },
  {
    label: "Улучшенный одноместный номер с двуспальной кроватью",
    value: 22,
  },
  {
    label: "Общий 9-местный номер",
    value: 23,
  },
  {
    label: 'Четырехместный номер "Комфорт"',
    value: 24,
  },
  {
    label: "Четырехместный номер Делюкс",
    value: 25,
  },
  {
    label: "Бюджетный четырехместный номер",
    value: 26,
  },
  {
    label: 'Четырехместный номер "Премиум"',
    value: 27,
  },
  {
    label: "Четырехместный номер - Для физически ограниченных лиц",
    value: 28,
  },
  {
    label: "Стандартный четырехместный номер с балконом",
    value: 29,
  },
  {
    label: "Четырехместный номер с общей ванной комнатой",
    value: 30,
  },
  {
    label: "Стандартный четырехместный номер с видом на сад",
    value: 31,
  },
  {
    label: "Стандартный четырехместный номер с видом на озеро",
    value: 32,
  },
  {
    label: "Стандартный четырехместный номер с видом на горы",
    value: 33,
  },
  {
    label: "Улучшенный четырехместный номер",
    value: 34,
  },
  {
    label: "Четырехместный номер с террасой ",
    value: 35,
  },
  {
    label: "Стандартный четырехместный номер ",
    value: 36,
  },
  {
    label: "Семейный номер Делюкс",
    value: 37,
  },
  {
    label: "Семейный двухместный номер с 1 кроватью",
    value: 38,
  },
  {
    label: "Семейный номер - Для физически ограниченных лиц",
    value: 39,
  },
  {
    label: "Семейный номер с балконом",
    value: 40,
  },
  {
    label: "Семейный номер с видом на сад",
    value: 41,
  },
  {
    label: "Семейный номер с видом на озеро",
    value: 42,
  },
  {
    label: "Семейный номер с видом на горы",
    value: 43,
  },
  {
    label: "Семейный номер с общей ванной комнатой",
    value: 44,
  },
  {
    label: "Семейный номер с терассой",
    value: 45,
  },
  {
    label: "Улучшенный семейный номер",
    value: 46,
  },
  {
    label: "Семейные 2-х комнатные номера",
    value: 47,
  },
  {
    label: "Семейный номер с балконом (1 этаж)",
    value: 48,
  },
  {
    label: "Семейный номер с балконом (2 этаж)",
    value: 49,
  },
  {
    label: "Русский комплекс",
    value: 50,
  },
  {
    label: "Евро комплекс",
    value: 51,
  },
  {
    label: "Семейный комплекс",
    value: 52,
  },
  {
    label: "Семейный номер (для 2 взрослых + 1 ребенка)",
    value: 53,
  },
  {
    label: "Спорт Комплекс",
    value: 54,
  },
  {
    label: "Семейный номер",
    value: 55,
  },
  {
    label: "Апартамент",
    value: 56,
  },
  {
    label: "Апартаменты -Первый этаж",
    value: 57,
  },
  {
    label: "Двухуровневые апартаменты",
    value: 58,
  },
  {
    label: "Апартамент с балконом ",
    value: 59,
  },
  {
    label: "Апартаменты с видом на озеро",
    value: 60,
  },
  {
    label: "Апартаменты с видом на горы",
    value: 61,
  },
  {
    label: "Апартаменты с видом на бассейн",
    value: 62,
  },
  {
    label: "Апартамент с общей ванной ",
    value: 63,
  },
  {
    label: "Апартамент с террасой ",
    value: 64,
  },
  {
    label: "Апартамент Делюкс ",
    value: 65,
  },
  {
    label: "Апартаменты с 1 спальней",
    value: 66,
  },
  {
    label: "Апартаменты-студио",
    value: 67,
  },
  {
    label: "Улучшенный апартамент",
    value: 68,
  },
  {
    label: "Улучшенный апартамент с сауной",
    value: 69,
  },
  {
    label: "Апартаменты с 3 спальнями",
    value: 70,
  },
  {
    label: "Апартаменты с 2 спальнями",
    value: 71,
  },
  {
    label: "Апартаменты - VIP",
    value: 72,
  },
  {
    label: "Апартаменты с 5 спальнями",
    value: 73,
  },
  {
    label: "Двухуровневые апартаменты-люкс",
    value: 74,
  },
  {
    label: "Кровать в общем 10-местном номере для мужчин и женщин",
    value: 75,
  },
  {
    label: "Кровать в общем 4-местном номере для мужчин и женщин",
    value: 76,
  },
  {
    label: "10-местный общий номер",
    value: 77,
  },
  {
    label: "Кровать в общем 6-местном номере для мужчин и женщин ",
    value: 78,
  },
  {
    label: "Общий 6-местный номер для мужчин",
    value: 79,
  },
  {
    label: "Общий 6-местный номер для женщин",
    value: 80,
  },
  {
    label: "Кровать в общем 8-местном номере",
    value: 81,
  },
  {
    label: "Кровать в общем 8-местном номере для мужчин и женщин ",
    value: 82,
  },
  {
    label: "Двухъярусная кровать в женском общем номере",
    value: 83,
  },
  {
    label: "Двухъярусная кровать в мужском общем номере",
    value: 84,
  },
  {
    label: "Двухъярусная кровать в общем номере для мужчин и женщин",
    value: 85,
  },
  {
    label: "Односпальная кровать в общем номере с 10 кроватями",
    value: 86,
  },
  {
    label: "Односпальная кровать в общем номере с 4 кроватями",
    value: 87,
  },
  {
    label: "Односпальная кровать в общем номере с 6 кроватями",
    value: 88,
  },
  {
    label: "Односпальная кровать в совместном общем номере",
    value: 89,
  },
  {
    label: "Односпальная кровать в общем номере",
    value: 90,
  },
  {
    label: "Односпальная кровать в женском общем номере",
    value: 91,
  },
  {
    label: "Односпальная кровать в мужском общем номере",
    value: 92,
  },
  {
    label: "Общий пятиместный номер ",
    value: 93,
  },
  {
    label: "Общий шестиместный номер ",
    value: 94,
  },
  {
    label: "Односпальная кровать в общем номере с 2 кроватями",
    value: 95,
  },
  {
    label: "Односпальная кровать в общем номере с 3 кроватями",
    value: 96,
  },
  {
    label: "Односпальная кровать в общем номере с 12 кроватями",
    value: 97,
  },
  {
    label: "Односпальная кровать в общем номере с 20 кроватями",
    value: 98,
  },
  {
    label: "Капсула",
    value: 99,
  },
  {
    label: "12-местный общий номер",
    value: 100,
  },
  {
    label: "16-местный общий номер",
    value: 101,
  },
  {
    label: "Односпальная кровать в общем номере с 4 кроватями",
    value: 102,
  },
  {
    label: "Односпальная кровать в общем номере с 5 кроватями",
    value: 103,
  },
  {
    label: "Общий 10-местный номер для мужчин",
    value: 104,
  },
  {
    label: "Общий 8-местный номер для женщин.",
    value: 105,
  },
  {
    label: "Общий 7-местный номер",
    value: 106,
  },
  {
    label: "Двухместный номер с видом на парк",
    value: 107,
  },
  {
    label: "Двухместный номер Делюкс с 1 кроватью (для 1 взрослого и 2 детей)",
    value: 108,
  },
  {
    label: "Небольшой двухместный номер с 1 кроватью ",
    value: 109,
  },
  {
    label: "Двухместный Делюкс с 1 кроватью ",
    value: 110,
  },
  {
    label: "Двухместный номер бизнес-класса с доступом в тренажерный зал",
    value: 111,
  },
  {
    label: "Двухместный номер Делюкс с 1 кроватью + дополнительная кровать",
    value: 112,
  },
  {
    label: "Двухместный номер Делюкс с 1 кроватью (на 2 взрослых + 1 ребенка)",
    value: 113,
  },
  {
    label:
      "Двухместный номер Делюкс с 1 кроватью (для 1 взрослого и 1 ребенка)",
    value: 114,
  },
  {
    label: "Двухместный номер Делюкс с 1 кроватью и балконом",
    value: 115,
  },
  {
    label: "Большой двухместный номер",
    value: 116,
  },
  {
    label: "Двухместный номер - Для физически ограниченных лиц",
    value: 117,
  },
  {
    label: "Двухместный номер Делюкс с 1 кроватью и балконом, вид на озеро",
    value: 118,
  },
  {
    label: "Двухместный номер Делюкс с 1 кроватью и ванной",
    value: 119,
  },
  {
    label: "Двухместный номер Делюкс с 1 кроватью и видом на замок/дворец",
    value: 120,
  },
  {
    label: "Двухместный номер Делюкс с 1 кроватью и душем",
    value: 121,
  },
  {
    label:
      "Двухместный номер с 1 двуспальной кроватью и дополнительной кроватью",
    value: 122,
  },
  {
    label: "Двухместный номер с 1 кроватью (для 1 взрослого и 1 ребенка)",
    value: 123,
  },
  {
    label: "Стандартный Двухместный номер с 1 кроватью и балконом",
    value: 124,
  },
  {
    label:
      "Двухместный номер с 1 кроватью и балконом (для 2 взрослых и 1 ребенка)",
    value: 125,
  },
  {
    label: "Двухместный номер с 1 кроватью и видом на бассейн",
    value: 126,
  },
  {
    label: "Двухместный номер с 1 кроватью и видом на горы",
    value: 127,
  },
  {
    label: "Двухместный номер с 1 кроватью и видом на сад",
    value: 128,
  },
  {
    label: "Двухместный номер с 1 кроватью и общей ванной комнатой",
    value: 129,
  },
  {
    label: "Двухместный номер с 1 кроватью и общим туалетом",
    value: 130,
  },
  {
    label: "Двухместный номер с 1 кроватью и патио/внутренним двориком",
    value: 131,
  },
  {
    label:
      "Двухместный номер с 1 кроватью и собственной внешней ванной комнатой",
    value: 132,
  },
  {
    label: "Двухместный номер с 1 кроватью и террасой",
    value: 133,
  },
  {
    label: "Двухместный номер с 1 кроватью и видом на озеро",
    value: 134,
  },
  {
    label: "Бюджетный Двухместный номер с 1 кроватью",
    value: 135,
  },
  {
    label: 'Номер Делюкс с кроватью размера "queen-size"',
    value: 136,
  },
  {
    label: "Номер Делюкс с кроватью размера «king-size»",
    value: 137,
  },
  {
    label: 'Номер с кроватью размера "king-size" и балконом',
    value: 138,
  },
  {
    label: 'Номер с кроватью размера "king-size" и видом на озеро',
    value: 139,
  },
  {
    label: 'Номер с кроватью размера "king-size" и видом на сад',
    value: 140,
  },
  {
    label: 'Номер с кроватью размера "king-size" и гидромассажной ванной',
    value: 141,
  },
  {
    label:
      'Номер с кроватью размера "king-size" –  Для физически ограниченных лиц',
    value: 142,
  },
  {
    label: 'Номер с кроватью размера "queen-size" и видом на сад',
    value: 143,
  },
  {
    label: 'Номер с кроватью размера "queen-size" и гидромассажной ванной',
    value: 144,
  },
  {
    label: "Номер с кроватью размера «king-size»",
    value: 145,
  },
  {
    label: "Номер с кроватью размера «king-size» и видом на бассейн",
    value: 146,
  },
  {
    label: "Номер с кроватью размера «king-size» и видом на горы",
    value: 147,
  },
  {
    label: "Номер с кроватью размера «queen-size»",
    value: 148,
  },
  {
    label:
      "Номер с кроватью размера «queen-size» - Для физически ограниченных лиц",
    value: 149,
  },
  {
    label: "Номер с кроватью размера «queen-size» и балконом",
    value: 150,
  },
  {
    label: "Номер с кроватью размера «queen-size» и видом на бассейн",
    value: 151,
  },
  {
    label: "Стандартный двухместный номер с 1 кроватью",
    value: 152,
  },
  {
    label: 'Стандартный номер с кроватью размера "king-size"',
    value: 153,
  },
  {
    label: 'Стандартный номер с кроватью размера "queen-size"',
    value: 154,
  },
  {
    label: "Улучшенный двухместный номер с 1 кроватью",
    value: 155,
  },
  {
    label: 'Улучшенный номер с кроватью размера "king-size"',
    value: 156,
  },
  {
    label: 'Улучшенный номер с кроватью размера "queen-size"',
    value: 157,
  },
  {
    label: "Двухместный номер премиум плюс с 1 кроватью",
    value: 158,
  },
  {
    label: 'Двухместный номер "Комфорт" с 1 кроватью',
    value: 159,
  },
  {
    label: "Предпринимательский Делюкс номер",
    value: 160,
  },
  {
    label: "Бизнес Номер",
    value: 161,
  },
  {
    label: "Двухместный Делюкс Дабл +",
    value: 162,
  },
  {
    label: "Трехместный номер - Для физически ограниченных лиц",
    value: 163,
  },
  {
    label: "Бюджетный трехместный номер",
    value: 164,
  },
  {
    label: "Представительский трехместный номер",
    value: 165,
  },
  {
    label: "Стандартный трехместный номер",
    value: 166,
  },
  {
    label: "Стандартный трехместный номер с видом на берег",
    value: 167,
  },
  {
    label: 'Трехместный номер "Комфорт"',
    value: 168,
  },
  {
    label: 'Трехместный номер "Комфорт" с душем',
    value: 169,
  },
  {
    label: "Трехместный номер Делюкс",
    value: 170,
  },
  {
    label: "Трехместный номер Делюкс с видом на берег",
    value: 171,
  },
  {
    label: "Трехместный номер с балконом",
    value: 172,
  },
  {
    label: "Трехместный номер с ванной комнатой",
    value: 173,
  },
  {
    label: "Трехместный номер с видом на бассейн",
    value: 174,
  },
  {
    label: "Трехместный номер с видом на город",
    value: 175,
  },
  {
    label: "Трехместный номер с видом на горы",
    value: 176,
  },
  {
    label: "Трехместный номер с видом на озеро",
    value: 177,
  },
  {
    label: "Трехместный номер с видом на сад",
    value: 178,
  },
  {
    label: "Трехместный номер с общей ванной комнатой",
    value: 179,
  },
  {
    label: "Трехместный номер с общим туалетом",
    value: 180,
  },
  {
    label: "Трехместный номер без окон",
    value: 181,
  },
  {
    label: "Трехместный номер с собственной внешней ванной",
    value: 182,
  },
  {
    label: "Трехместный номер с террасой",
    value: 183,
  },
  {
    label: "Улучшенный трехместный номер",
    value: 184,
  },
  {
    label: "Улучшенный трехместный номер с видом на берег",
    value: 185,
  },
  {
    label: "Трехместный номер + раскладная диван-кровать",
    value: 186,
  },
  {
    label: "Четырехместный коттедж",
    value: 187,
  },
  {
    label: "Коттедж с 3 спальнями ",
    value: 188,
  },
  {
    label: "Шестиместный Коттедж",
    value: 189,
  },
  {
    label: "Десятиместный Коттедж",
    value: 190,
  },
  {
    label: "Двенадцатиместный Коттедж",
    value: 191,
  },
  {
    label: "Двухместный Коттедж",
    value: 192,
  },
  {
    label: "Семейный Люкс Коттедж",
    value: 193,
  },
  {
    label: "Трехместный коттедж",
    value: 194,
  },
  {
    label: "Номер-студио - Двухуровневый",
    value: 195,
  },
  {
    label: "Номер-студио - Для физически ограниченных лиц",
    value: 196,
  },
  {
    label: "Номер-студио Делюкс",
    value: 197,
  },
  {
    label: 'Номер-студио Делюкс с кроватью размера "king-size"',
    value: 198,
  },
  {
    label: 'Номер-студио Делюкс с кроватью размера "queen-size"',
    value: 199,
  },
  {
    label: "Номер-студио с балконом",
    value: 200,
  },
  {
    label: "Номер-студио с видом на бассейн",
    value: 201,
  },
  {
    label: "Номер-студио с видом на горы",
    value: 202,
  },
  {
    label: "Номер-студио с видом на берег",
    value: 203,
  },
  {
    label: "Номер-студио с видом на озеро",
    value: 204,
  },
  {
    label: "Номер-студио с видом на сад",
    value: 205,
  },
  {
    label: "Номер-студио с джакузи",
    value: 206,
  },
  {
    label: 'Номер-студио с кроватью размера "king-size"',
    value: 207,
  },
  {
    label: 'Номер-студио с кроватью размера "queen-size"',
    value: 208,
  },
  {
    label: "Номер-студио с террасой",
    value: 209,
  },
  {
    label: "Семейный номер-студио",
    value: 210,
  },
  {
    label: "Трехместный номер-студио",
    value: 211,
  },
  {
    label: "Улучшенный номер - студио",
    value: 212,
  },
  {
    label: "Номер-студио",
    value: 213,
  },
  {
    label: "Большой двухместный номер c 1 кроватью или 2 отдельными кроватями",
    value: 214,
  },
  {
    label:
      "Бюджетный двухместный номер с 1 кроватью или 2 отдельными кроватями",
    value: 215,
  },
  {
    label: "Двухместный номер Делюкс с 1 кроватью или 2 отдельными кроватями",
    value: 216,
  },
  {
    label:
      "Двухместный номер Делюкс с 1 кроватью или 2 отдельными кроватями и балконом",
    value: 217,
  },
  {
    label:
      "Двухместный номер Делюкс с 1 кроватью или 2 отдельными кроватями и видом на бассейн",
    value: 218,
  },
  {
    label:
      "Двухместный номер Делюкс с 1 кроватью или 2 отдельными кроватями и видом на берег",
    value: 219,
  },
  {
    label:
      "Двухместный номер Делюкс с 1 кроватью или 2 отдельными кроватями и видом на реку",
    value: 220,
  },
  {
    label:
      "Двухместный номер Делюкс с 1 кроватью или 2 отдельными кроватями и гидромассажной ванной",
    value: 221,
  },
  {
    label:
      "Двухместный номер Делюкс с 1 кроватью или 2 отдельными кроватями, вид на город",
    value: 222,
  },
  {
    label:
      "Двухместный номер Делюкс с 1 кроватью или 2 отдельными кроватями, вид на горы",
    value: 223,
  },
  {
    label:
      "Двухместный номер Делюкс с 1 кроватью или 2 отдельными кроватями, вид на озеро",
    value: 224,
  },
  {
    label:
      "Двухместный номер Делюкс с 1 кроватью или 2 отдельными кроватями, вид на сад",
    value: 225,
  },
  {
    label:
      "Двухместный номер Делюкс с 1 кроватью или 2 отдельными кроватями, доступ к бассейну",
    value: 226,
  },
  {
    label:
      "Стандартный двухместный номер с 1 кроватью или 2 отдельными кроватями",
    value: 227,
  },
  {
    label:
      "Двухместный номер с 1 кроватью или 2 отдельными кроватями - Для физически ограниченных лиц",
    value: 228,
  },
  {
    label:
      "Двухместный номер с 1 кроватью или 2 отдельными кроватями и видом на бассейн",
    value: 229,
  },
  {
    label:
      "Двухместный номер с 1 кроватью или 2 отдельными кроватями и видом на город",
    value: 230,
  },
  {
    label:
      "Двухместный номер с 1 кроватью или 2 отдельными кроватями и видом на берег",
    value: 231,
  },
  {
    label:
      "Двухместный номер с 1 кроватью или 2 отдельными кроватями и возможностью посещения спа-салона",
    value: 232,
  },
  {
    label:
      "Двухместный номер с 1 кроватью или 2 отдельными кроватями и дополнительной кроватью",
    value: 233,
  },
  {
    label: "Двухместный номер с 1 кроватью или 2 отдельными кроватями и душем",
    value: 234,
  },
  {
    label:
      "Двухместный номер с 1 кроватью или 2 отдельными кроватями и общей ванной комнатой",
    value: 235,
  },
  {
    label:
      "Двухместный номер с 1 кроватью или 2 отдельными кроватями и собственной внешней ванной комнатой",
    value: 236,
  },
  {
    label:
      "Двухместный номер с 1 кроватью или 2 отдельными кроватями и террасой",
    value: 237,
  },
  {
    label:
      "Двухместный номер с 1 кроватью или 2 отдельными кроватями, вид на горы",
    value: 238,
  },
  {
    label:
      "Двухместный номер с 1 кроватью или 2 отдельными кроватями, вид на озеро",
    value: 239,
  },
  {
    label:
      "Двухместный номер с 1 кроватью или 2 отдельными кроватями, вид на сад",
    value: 240,
  },
  {
    label:
      "Небольшой двухместный номер с 1 кроватью или 2 отдельными кроватями",
    value: 241,
  },
  {
    label:
      "Улучшенный двухместный номер с 1 кроватью или 2 отдельными кроватями",
    value: 242,
  },
  {
    label:
      "Улучшенный двухместный номер с 1 кроватью или 2 отдельными кроватями и видом на город",
    value: 243,
  },
  {
    label:
      "Улучшенный двухместный номер с 1 кроватью или 2 отдельными кроватями и видом на берег",
    value: 244,
  },
  {
    label:
      "Улучшенный двухместный номер с 1 кроватью или 2 отдельными кроватями и видом на озеро",
    value: 245,
  },
  {
    label:
      "Улучшенный двухместный номер с 1 кроватью или 2 отдельными кроватями и видом на сад",
    value: 246,
  },
  {
    label:
      "Улучшенный двухместный номер с 1 кроватью или 2 отдельными кроватями и террасой",
    value: 247,
  },
  {
    label:
      "Улучшенный двухместный номер с 1 кроватью или 2 отдельными кроватями, вид на бассейн",
    value: 248,
  },
  {
    label:
      "Улучшенный двухместный номер с 1 кроватью или 2 отдельными кроватями, вид на горы",
    value: 249,
  },
  {
    label:
      "Двухместный номер Делюкс с 1 или 2 раздельными кроватями и с видом на достопримечательности ",
    value: 250,
  },
  {
    label:
      'Двухместный номер "Комфорт" с 1 большой кроватью или 2 раздельными кроватями',
    value: 251,
  },
  {
    label: 'Двухместный номер "Эконом" ',
    value: 252,
  },
  {
    label: "Большой двухместный номер с 2 отдельными кроватями",
    value: 253,
  },
  {
    label: "Бюджетный двухместный номер с 2 отдельными кроватями",
    value: 254,
  },
  {
    label: "Двухместный номер Делюкс с 2 двуспальными кроватями",
    value: 255,
  },
  {
    label: "Двухместный номер Делюкс с 2 отдельными кроватями",
    value: 256,
  },
  {
    label: "Двухместный номер с 2 двуспальными кроватями",
    value: 257,
  },
  {
    label: "Стандартный двухместный номер с 2 отдельными кроватями",
    value: 258,
  },
  {
    label:
      "Двухместный номер с 2 отдельными кроватями - Для физически ограниченных лиц",
    value: 259,
  },
  {
    label: "Двухместный номер с 2 отдельными кроватями и балконом",
    value: 260,
  },
  {
    label: "Двухместный номер с 2 отдельными кроватями и ванной комнатой",
    value: 261,
  },
  {
    label: "Двухместный номер с 2 отдельными кроватями и видом на бассейн",
    value: 262,
  },
  {
    label: "Двухместный номер с 2 отдельными кроватями и видом на город",
    value: 263,
  },
  {
    label: "Двухместный номер с 2 отдельными кроватями и видом на горы",
    value: 264,
  },
  {
    label: "Двухместный номер с 2 отдельными кроватями и видом на озеро",
    value: 265,
  },
  {
    label:
      "Двухместный номер с 2 отдельными кроватями и дополнительной кроватью",
    value: 266,
  },
  {
    label: "Двухместный номер с 2 отдельными кроватями и душем",
    value: 267,
  },
  {
    label: "Двухместный номер с 2 отдельными кроватями и общей ванной комнатой",
    value: 268,
  },
  {
    label: "Двухместный номер с 2 отдельными кроватями и общим туалетом",
    value: 269,
  },
  {
    label: "Двухместный номер с 2 отдельными кроватями и без окон",
    value: 270,
  },
  {
    label:
      "Двухместный номер с 2 отдельными кроватями и собственной внешней ванной комнатой",
    value: 271,
  },
  {
    label: "Двухместный номер с 2 отдельными кроватями и террасой",
    value: 272,
  },
  {
    label: "Двухместный номер с 2 отдельными кроватями, вид на сад",
    value: 273,
  },
  {
    label: "Небольшой двухместный номер с 2 отдельными кроватями",
    value: 274,
  },
  {
    label: "Улучшенный двухместный номер с 2 двуспальными кроватями",
    value: 275,
  },
  {
    label: "Улучшенный двухместный номер с 2 отдельными кроватями",
    value: 276,
  },
  {
    label:
      "Улучшенный двухместный номер с 2 отдельными кроватями и видом на город",
    value: 277,
  },
  {
    label:
      "Улучшенный двухместный номер с 2 отдельными кроватями и видом на сад",
    value: 278,
  },
  {
    label: "Улучшенный двухместный номер с 2 отдельными кроватями и сауной",
    value: 279,
  },
  {
    label: "Улучшенный номер с 2 кроватями размера «queen-size»",
    value: 280,
  },
  {
    label: "Двухместный номер с двумя комнатами  ",
    value: 281,
  },
  {
    label: "Стандартный Премиум Твин",
    value: 282,
  },
  {
    label: "Стандартный Премиум Твин +",
    value: 283,
  },
  {
    label: "Люкс с балконом",
    value: 284,
  },
  {
    label: "Люкс с 1 спальней ",
    value: 285,
  },
  {
    label: "Люкс с 2 спальнями ",
    value: 286,
  },
  {
    label: "Люкс номер с двумя раздельными кроватями",
    value: 287,
  },
  {
    label: "Люкс номер с террасой ",
    value: 288,
  },
  {
    label: "Супер Люкс",
    value: 289,
  },
  {
    label: "Люкс с 1 кроватью",
    value: 290,
  },
  {
    label: "Люкс трехместный",
    value: 291,
  },
  {
    label: "Люкс",
    value: 292,
  },
  {
    label: "Люкс одноместный ",
    value: 293,
  },
  {
    label: "Люкс двухместный",
    value: 294,
  },
  {
    label: "Гранд Люкс",
    value: 295,
  },
  {
    label: "Люкс с двумя комнатами",
    value: 296,
  },
  {
    label: 'Люкс "Восток" Двухкомнатный ',
    value: 297,
  },
  {
    label: "VIP номер",
    value: 298,
  },
  {
    label: 'Люкс номер "Комфорт"',
    value: 299,
  },
  {
    label: 'Люкс номер "Панорама"',
    value: 300,
  },
  {
    label: 'Люкс номер с кроватью "king-size"',
    value: 301,
  },
  {
    label: 'Люкс номер "Султан"',
    value: 302,
  },
  {
    label: "Президентский Люкс",
    value: 303,
  },
  {
    label: "Представительский Люкс",
    value: 304,
  },
  {
    label: "Бизнес Люкс",
    value: 305,
  },
  {
    label: "Романтический люкс ",
    value: 306,
  },
  {
    label: "Роскошный Люкс",
    value: 307,
  },
  {
    label: "Люкс Четырехместный",
    value: 308,
  },
  {
    label: "Люкс Семейный",
    value: 309,
  },
  {
    label: "Люкс с видом на сад",
    value: 310,
  },
  {
    label: "Премиум люкс",
    value: 311,
  },
  {
    label: "Семейный Люкс",
    value: 312,
  },
  {
    label: "Полу-люкс с 1 кроватью",
    value: 313,
  },
  {
    label: "Полу-люкс с 2 отдельными кроватями",
    value: 314,
  },
  {
    label: "Полу-люкс одноместный ",
    value: 315,
  },
  {
    label: "Полу-люкс трехместный ",
    value: 316,
  },
  {
    label: "Полу-люкс четырехместный ",
    value: 317,
  },
  {
    label: "Полу-люкс с 1 или 2 кроватями",
    value: 318,
  },
  {
    label: 'Полу-люкс с кроватью размера "king-size" и с балконом',
    value: 319,
  },
  {
    label: "Юрта",
    value: 320,
  },
  {
    label: "Трехместная Юрта ",
    value: 321,
  },
  {
    label: "Двухместная Юрта",
    value: 322,
  },
  {
    label: "Люкс Юрта",
    value: 323,
  },
  {
    label: 'Люкс Юрта  "EMIR"',
    value: 324,
  },
  {
    label: "Бунгало",
    value: 325,
  },
  {
    label: "Конференц-зал",
    value: 326,
  },
  {
    label: "Стандартный пятиместный номер",
    value: 327,
  },
  {
    label: "Улучшенный пятиместный номер ",
    value: 328,
  },
  {
    label: 'Пятиместный номер "Комфорт"',
    value: 329,
  },
  {
    label: "Шале с двумя спальнями ",
    value: 330,
  },
  {
    label: "Шале с одной спальней",
    value: 331,
  },
  {
    label: "Шале",
    value: 332,
  },
  {
    label: "Топчан",
    value: 333,
  },
  {
    label: "Общий 7-местный номер для мужчин",
    value: 334,
  },
  {
    label: "Общий 11-местный номер",
    value: 335,
  },
  {
    label: "Общий 12-местный номер",
    value: 336,
  },
  {
    label: "Общий 13-местный номер для женщин.",
    value: 337,
  },
];

export const BED_TYPES = [
  {
    label: "Односпальная кровать",
    value: 1,
  },
  {
    label: "Двухъярусная кровать",
    value: 2,
  },
  {
    label: "Топчан",
    value: 3,
  },
  {
    label: "Двуспальная кровать",
    value: 4,
  },
  {
    label: "Две раздельные кровати",
    value: 5,
  },
  {
    label: "Три раздельные кровати",
    value: 6,
  },
  {
    label: "Четыре раздельные кровати",
    value: 7,
  },
  {
    label: "Пять односпальных кроватей",
    value: 8,
  },
  {
    label: "Посадочное место",
    value: 9,
  },
  {
    label: "Детская кроватка",
    value: 10,
  },
];

export const BED_NUMBERS = [
  {
    label: "1",
    value: 1,
  },
  {
    label: "2",
    value: 2,
  },
  {
    label: "3",
    value: 3,
  },
  {
    label: "4",
    value: 4,
  },
  {
    label: "5",
    value: 5,
  },
  {
    label: "6",
    value: 6,
  },
  {
    label: "7",
    value: 7,
  },
  {
    label: "8",
    value: 8,
  },
  {
    label: "9",
    value: 9,
  },
  {
    label: "10",
    value: 10,
  },
];

export const LANGUAGES = [
  {
    label: "Казахский",
    value: 1,
  },
  {
    label: "Английский",
    value: 2,
  },
  {
    label: "Русский",
    value: 3,
  },
  {
    label: "Немецкий",
    value: 4,
  },
];

export const PROPERTY_SERVICES = [
  {
    label: "Wi-fi",
    value: 1,
  },
  {
    label: "Бассейн",
    value: 2,
  },
  {
    label: "Фитнес",
    value: 3,
  },
  {
    label: "Детская площадка",
    value: 4,
  },
  {
    label: "Лифт",
    value: 5,
  },
  {
    label: "Трансфер",
    value: 6,
  },
  {
    label: "Гидромассажная ванна",
    value: 7,
  },
  {
    label: "Оплата Visa Card",
    value: 8,
  },
  {
    label: "Оплата Kaspi QR",
    value: 16,
  },
  {
    label: "Ресторан",
    value: 9,
  },
  {
    label: "Сауна",
    value: 10,
  },
  {
    label: "Детский клуб",
    value: 11,
  },
  {
    label: "Конференц-зал",
    value: 12,
  },
  {
    label: "Семейные номера",
    value: 13,
  },
  {
    label: "Уличная парковка",
    value: 14,
  },
  {
    label: "Оплата Master Card",
    value: 15,
  },
];

export const FACILITIES_CATEGORIES = [
  {
    label: "Ванная комната",
    value: [
      {
        label: "Душевая кабина",
        value: 1,
      },
      {
        label: "Ванна",
        value: 2,
      },
      {
        label: "Гидромассажная ванна",
        value: 3,
      },
      {
        label: "Общая ванная и туалетная комната",
        value: 4,
      },
      {
        label: "Биде",
        value: 5,
      },
      {
        label: "Банный халат",
        value: 6,
      },
      {
        label: "Тапочки",
        value: 7,
      },
      {
        label: "Бесплатные туалетные принадлежности",
        value: 8,
      },
      {
        label: "Туалет",
        value: 9,
      },
      {
        label: "Туалетная бумага",
        value: 10,
      },
      {
        label: "Сушилка для рук",
        value: 11,
      },
      {
        label: "Полотенца",
        value: 12,
      },
      {
        label: "Фен",
        value: 13,
      },
      {
        label: "Зубная щетка",
        value: 14,
      },
      {
        label: "Шапочка для душа",
        value: 15,
      },
    ],
  },
  {
    label: "Питание и напитки",
    value: [
      {
        label: "Холодильник",
        value: 16,
      },
      {
        label: "Обеденный уголок",
        value: 17,
      },
      {
        label: "Обеденный стол",
        value: 18,
      },
      {
        label: "Принадлежности для барбекю",
        value: 19,
      },
      {
        label: "Плита",
        value: 20,
      },
      {
        label: "Тостер",
        value: 21,
      },
      {
        label: "Электрический чайник",
        value: 22,
      },
      {
        label: "Мини бар",
        value: 23,
      },
      {
        label: "Обеденная зона на улице",
        value: 24,
      },
      {
        label: "Мини-кухня",
        value: 25,
      },
      {
        label: "Кухонные принадлежности",
        value: 26,
      },
      {
        label: "Микроволновая печь",
        value: 27,
      },
      {
        label: "Кофемашина",
        value: 28,
      },
      {
        label: "Бутылка воды",
        value: 29,
      },
    ],
  },
  {
    label: "Удобства",
    value: [
      {
        label: "Деревянный/Паркетный пол",
        value: 30,
      },
      {
        label: "Вешалка для одежды",
        value: 31,
      },
      {
        label: "Сушилка для одежды",
        value: 32,
      },
      {
        label: "Шкаф/гардероб",
        value: 33,
      },
      {
        label: "Сушилка",
        value: 34,
      },
      {
        label: "Раскладная кровать",
        value: 35,
      },
      {
        label: "Ковровое покрытие",
        value: 36,
      },
      {
        label: "Диван",
        value: 37,
      },
      {
        label: "Удлиненные кровати (более 2 метров)",
        value: 38,
      },
      {
        label: "Вентилятор",
        value: 39,
      },
      {
        label: "Рабочий стол",
        value: 40,
      },
      {
        label: "Камин",
        value: 41,
      },
      {
        label: "Отопление",
        value: 42,
      },
      {
        label: "Смежный номер",
        value: 43,
      },
      {
        label: "Утюг",
        value: 44,
      },
      {
        label: "Гладильная доска",
        value: 45,
      },
      {
        label: "Москитная сетка",
        value: 46,
      },
      {
        label: "Гостинная",
        value: 47,
      },
      {
        label: "Туалет с поручнем",
        value: 48,
      },
      {
        label: "Лифт",
        value: 49,
      },
      {
        label: "Лестница",
        value: 50,
      },
      {
        label: "Диван-кровать",
        value: 51,
      },
      {
        label: "Корзины для мусора",
        value: 52,
      },
      {
        label: "Собственный бассейн",
        value: 53,
      },
      {
        label: "Плиточный/мраморный пол",
        value: 54,
      },
      {
        label: "Пижама",
        value: 55,
      },
      {
        label: "Розетка около кровати",
        value: 56,
      },
    ],
  },
  {
    label: "Технологии",
    value: [
      {
        label: "Кондиционер",
        value: 57,
      },
      {
        label: "Компьютер",
        value: 58,
      },
      {
        label: "Чиллер",
        value: 59,
      },
      {
        label: "Игровая приставка",
        value: 60,
      },
      {
        label: "Сейф",
        value: 61,
      },
      {
        label: "Звукоизоляция",
        value: 62,
      },
      {
        label: "Wi-Fi",
        value: 63,
      },
      {
        label: "Телефон",
        value: 64,
      },
      {
        label: "Телевизор с плоским экраном",
        value: 65,
      },
      {
        label: "Спутниковые каналы",
        value: 66,
      },
      {
        label: "Кабельные каналы",
        value: 67,
      },
    ],
  },
  {
    label: "Услуги и дополнения",
    value: [
      {
        label: "Будильник",
        value: 68,
      },
      {
        label: "Услуга 'звонок-будильник'",
        value: 69,
      },
      {
        label: "Постельное белье",
        value: 70,
      },
      {
        label: "Постельное белье (за дополнительную плату)",
        value: 71,
      },
      {
        label: "Прачечная",
        value: 72,
      },
      {
        label: "Прачечная (за дополнительную плату)",
        value: 73,
      },
      {
        label: "Чистящие средства",
        value: 74,
      },
      {
        label: "Ежедневная уборка",
        value: 75,
      },
      {
        label: "Вход по электронной карте",
        value: 76,
      },
      {
        label: "Вход по ключу",
        value: 77,
      },
      {
        label: "Запирающиеся шкафчики",
        value: 78,
      },
      {
        label: "Балкон",
        value: 79,
      },
      {
        label: "Номер находится на первом этаже",
        value: 80,
      },
    ],
  },
];
